{"command.restartServer":"Sunucuyu Yeniden Başlatın","extension.description":"Autopep8 formatlayıcıyı kullanarak Python dosyaları için formatlama desteği.","settings.args.description":"Python dosyalarını biçimlendirmek için autopep8'e aktarılan argümanlar. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. \n Örnek: \n `\"autopep8.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Python dosyalarını autopep8 ile biçimlendirmek için kullanılan geçerli çalışma dizinini ayarlar. Varsayılan olarak, '${workspaceFolder}' çalışma alanının kök dizinini kullanır. Biçimlendirilmekte olan dosyanın üst klasörünü autopep8 için çalışma dizini olarak kullanmak için bunu `${fileDirname}` olarak ayarlayabilirsiniz.","settings.importStrategy.description":"Python dosyalarını biçimlendirmek için hangi autopep8 biçimlendirici ikili dosyasının kullanılacağını tanımlar. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen autopep8 biçimlendirici ikili dosyasını kullanır. `fromEnvironment` olarak ayarlandığında uzantı, Black biçimlendirici ikili dosyasını ve şu anda seçili olan ortamda kullanılabilen tüm bağımlılıkları kullanmaya çalışılır. **Not**: Uzantı, seçili ortamda geçerli bir Black biçimlendirici ikili dosyası bulamazsa, uzantıyla birlikte gönderilen ikili dosyayı kullanmaya geri döner. `autopep8.path` ayarı önceliklidir ve `autopep8.importStrategy` davranışını geçersiz kılar.","settings.importStrategy.fromEnvironment.description":"Seçilen Python ortamından autopep8 ikili dosyasını kullanın. Uzantı geçerli bir autopep8 ikili dosyası bulamazsa, autopep8'in paketlenmiş sürümünü kullanmaya geri dönecektir.","settings.importStrategy.useBundled.description":"Python dosyalarını biçimlendirmek için her zaman autopep8'in paketlenmiş sürümünü kullanın.","settings.interpreter.description":"Python yürütülebilir dosyasının veya autopep8 sunucusunu ve herhangi bir alt işlemi başlatmak için kullanılacak komutun yolu. Tek veya birden çok dizenin dizisini kabul eder. `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır.","settings.path.description":"Python dosyalarını autopep8 ile biçimlendirmek için uzantı tarafından kullanılacak yol veya komut. Tek veya birden çok dizenin dizisini kabul eder. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır. `[\"autopep8\"]` olarak ayarlanırsa, `PATH` ortam değişkeninde mevcut olan autopep8 sürümünü kullanacaktır. Not: Bu seçeneğin kullanılması biçimlendirme işlemini yavaşlatabilir. \n  Örnekler: \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"Bildirimler, Python dosyaları biçimlendirilirken, sunucunun göstermeyi seçtiği her şey için gösterilir.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.","settings.showNotifications.off.description":"Tüm bildirimler kapatıldı, Python dosyaları biçimlendirilirken tüm hatalar veya uyarılar hâlâ günlüklerde mevcuttur.","settings.showNotifications.onError.description":"Bildirimler, yalnızca Python dosyaları biçimlendirilirken bir hata oluşması durumunda gösterilir.","settings.showNotifications.onWarning.description":"Python dosyaları biçimlendirilirken hatalar ve uyarılar için bildirimler gösterilir."}
