{"command.restartServer":"Reiniciar servidor","extension.description":"Compatibilidad con el formato de los archivos de Python mediante el formateador autopep8.","settings.args.description":"Argumentos pasados a autopep8 para dar formato a los archivos de Python. Cada argumento debe proporcionarse como una cadena independiente en la matriz. \n Ejemplo: \n '\"autopep8.args\" = [\"--config\", \"<file>\"]'","settings.cwd.description":"Establezca el directorio de trabajo actual que se usa para dar formato a los archivos de Python con autopep8. De manera predeterminada, se utiliza el directorio raíz del área de trabajo \"${workspaceFolder}\". Puede establecerlo en \"${fileDirname}\" para usar la carpeta principal del archivo que se está formateando como directorio de trabajo para autopep8.","settings.importStrategy.description":"Define qué binario de formateador autopep8 se va a usar para dar formato a los archivos de Python. Cuando se establece en 'useBundled', la extensión usará el binario formateador autopep8 que se incluye con la extensión. Cuando se establece en 'fromEnvironment', la extensión intentará usar el binario formateador autopep8 y todas las dependencias que están disponibles en el entorno seleccionado actualmente. **Nota**: Si la extensión no encuentra un binario de formateador autopep8 válido en el entorno seleccionado, se revertirá al uso del binario que se incluye con la extensión. El valor 'autopep8.path' tiene prioridad e invalida el comportamiento de 'autopep8.importStrategy'.","settings.importStrategy.fromEnvironment.description":"Utilice el archivo binario autopep8 del entorno de Python seleccionado. Si la extensión no encuentra un archivo binario de autopep8 válido, se revertirá al uso de la versión empaquetada de autopep8.","settings.importStrategy.useBundled.description":"Utilice siempre la versión empaquetada de autopep8 para dar formato a los archivos de Python.","settings.interpreter.description":"Ruta de acceso a un ejecutable de Python o un comando que se usará para iniciar el servidor autopep8 y cualquier subproceso. Esto acepta una matriz de una o varias cadenas. Cuando se establece en '[]', la extensión usará la ruta de acceso al intérprete de Python seleccionado. Si pasa un comando, cada argumento debe proporcionarse como una cadena independiente en la matriz.","settings.path.description":"Ruta de acceso o comando que usará la extensión para dar formato a los archivos de Python con autopep8. Acepta una matriz de una o varias cadenas. Si pasa un comando, cada argumento debe proporcionarse como una cadena independiente en la matriz. Si se establece en “[\"autopep8\"]”, se usará la versión de autopep8 disponible en la variable de entorno “PATH”. Nota: El uso de esta opción puede ralentizar la aplicación de formato. \n  Ejemplos: \n  - “[\"~/global_env/autopep8\"]” \n  - “[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]”","settings.showNotifications.always.description":"Las notificaciones se muestran para cualquier cosa que el servidor elija mostrar al dar formato a los archivos de Python.","settings.showNotifications.description":"Controla cuándo se muestran las notificaciones mediante esta extensión.","settings.showNotifications.off.description":"Todas las notificaciones están desactivadas, los errores o las advertencias al formatear archivos de Python siguen estando disponibles en los registros.","settings.showNotifications.onError.description":"Las notificaciones solo se muestran en caso de error al dar formato a archivos de Python.","settings.showNotifications.onWarning.description":"Se muestran notificaciones de los errores y advertencias al dar formato a archivos de Python."}
