{"command.restartServer":"Перезапустить сервер","extension.description":"Поддержка форматирования файлов Python с использованием форматировщика autopep8.","settings.args.description":"Аргументы, передаваемые в autopep8 для форматирования файлов Python. Каждый аргумент должен быть указан как отдельная строка в массиве. \n Пример: \n \"autopep8.args\" = [\"--config\", \"<файл>\"]","settings.cwd.description":"Устанавливает текущий рабочий каталог, используемый для форматирования файлов Python с помощью autopep8. По умолчанию используется корневой каталог рабочей области \"${workspaceFolder}\". Вы можете установить для него значение \"${fileDirname}\", чтобы использовать родительскую папку форматируемого файла в качестве рабочего каталога для autopep8.","settings.importStrategy.description":"Определяет двоичный файл форматировщика autopep8, который будет использоваться для форматирования файлов Python. Если настроено значение \"useBundled\", расширение будет использовать двоичный файл форматировщика autopep8, поставляемый вместе с расширением. Если настроено значение \"fromEnvironment\", расширение попытается использовать двоичный файл форматировщика autopep8 и все зависимости, доступные в выбранной среде. **Примечание**. Если расширение не может найти допустимый двоичный файл форматировщика autopep8 в выбранной среде, оно будет использовать двоичный файл, который поставляется с расширением. Параметр \"autopep8.path\" является более приоритетным и переопределяет поведение параметра \"autopep8.importStrategy\".","settings.importStrategy.fromEnvironment.description":"Используйте двоичный файл autopep8 из выбранной среды Python. Если расширению не удается найти допустимый двоичный файл autopep8, оно будет использовать пакетную версию autopep8.","settings.importStrategy.useBundled.description":"Для форматирования файлов Python всегда используйте пакетную версию autopep8.","settings.interpreter.description":"Путь к исполняемому файлу Python или команде, которая будет использоваться для запуска сервера autopep8 и всех подпроцессов. Принимает массив из одной или нескольких строк. Если задано значение \"[]\", расширение будет использовать путь к выбранному интерпретатору Python. При передаче команды каждый аргумент должен быть указан в виде отдельной строки в массиве.","settings.path.description":"Путь или команда, используемые расширением для форматирования файлов Python с помощью autopep8. Принимает массив из одной или нескольких строк. При передаче команды каждый аргумент должен быть указан в виде отдельной строки в массиве. Если задан параметр [\"autopep8\"], будет использоваться версия autopep8, доступная в переменной среды PATH. Примечание. Использование этого параметра может привести к замедлению форматирования. \n  Примеры: \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"Уведомления демонстрируются для всех элементов, которые сервер выбирает для отображения при форматировании файлов Python.","settings.showNotifications.description":"Определяет, когда уведомления отображаются этим расширением.","settings.showNotifications.off.description":"Все уведомления отключены, все ошибки и предупреждения форматирования файлов Python по-прежнему доступны в журналах.","settings.showNotifications.onError.description":"Уведомления отображаются только в случае ошибки при форматировании файлов Python.","settings.showNotifications.onWarning.description":"Уведомления отображаются для любых ошибок и предупреждений при форматировании файлов Python."}
