{"command.restartServer":"Restartovat server","extension.description":"Podpora formátování souborů Pythonu pomocí formátovacího modulu autopep8","settings.args.description":"Argumenty předané formátovacímu modulu autopep8 pro formátování souborů Pythonu Každý argument by měl být v poli zadán jako samostatný řetězec. \n Příklad: \n `\"autopep8.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Nastaví aktuální pracovní adresář, který se používá k formátování souborů Pythonu pomocí autopep8. Standardně používá kořenový adresář pracovního prostoru ${workspaceFolder}. Můžete ho nastavit na ${fileDirname}, aby se jako pracovní adresář pro autopep8 použila nadřazená složka souboru, který se formátuje.","settings.importStrategy.description":"Definuje, který binární soubor formátovacího modulu autopep8 se má použít k formátování souborů Pythonu. Pokud je nastaveno na useBundled, rozšíření použije binární soubor formátovacího modulu autopep8, který je dodáván s rozšířením. Při nastavení na fromEnvironment se rozšíření pokusí použít binární soubor formátovacího modulu autopep8 a všechny závislosti, které jsou k dispozici v aktuálně vybraném prostředí. **Poznámka**: Pokud rozšíření nemůže ve vybraném prostředí platný binární soubor formátovacího modulu autopep8 najít, použije místo toho binární soubor dodávaný s rozšířením. Poznámka: Nastavení autopep8.path má přednost a přepíše chování autopep8.importStrategy.","settings.importStrategy.fromEnvironment.description":"Použijte binární soubor autopep8 z vybraného prostředí Pythonu. Pokud rozšíření nenajde platný binární soubor autopep8, použije místo toho zkompletovanou verzi autopep8 dodávanou s rozšířením.","settings.importStrategy.useBundled.description":"K formátování souborů Pythonu vždy použije dodávanou verzi souboru autopep8.","settings.interpreter.description":"Cesta ke spustitelnému souboru Pythonu nebo k příkazu, který se použije ke spuštění serveru autopep8 a jakéhokoli podprocesu. Přijímá pole jednoho nebo více řetězců. Když se nastaví na [], rozšíření použije cestu k vybranému interpretu Pythonu. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli.","settings.path.description":"Cesta nebo příkaz, které má rozšíření použít k formátování souborů Pythonu pomocí formátovacího modulu autopep8. Přijímá pole jednoho nebo více řetězců. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli. Pokud je nastaveno na [\"autopep8\"], použije se verze autopep8 dostupná v proměnné prostředí PATH. Poznámka: Použití této možnosti může zpomalit formátování. \n  Příklady: \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"Oznámení se zobrazují pro všechno, co se server rozhodne zobrazit při formátování souborů Pythonu.","settings.showNotifications.description":"Určuje, kdy toto rozšíření zobrazuje oznámení.","settings.showNotifications.off.description":"Všechna oznámení jsou vypnuta, všechny chyby nebo upozornění při formátování souborů Pythonu jsou však dostupné v protokolech.","settings.showNotifications.onError.description":"Oznámení se zobrazují jenom v případě chyby při formátování souborů Pythonu.","settings.showNotifications.onWarning.description":"Při formátování souborů Pythonu se zobrazují oznámení o všech chybách a upozorněních."}
