{"command.restartServer":"Ponowne uruchamianie serwera","extension.description":"Obsługa formatowania plików w języku Python przy użyciu narzędzia do formatowania autopep8.","settings.args.description":"Argumenty przekazane do autopep8 w celu sformatowania plików języka Python. Każdy argument powinien być podany jako oddzielny ciąg w tablicy. \n Przykład: \n „\"autopep8.args\" = [\"--config\", \"<file>\"]”","settings.cwd.description":"Ustawia bieżący katalog roboczy używany do formatowania plików języka Python przy użyciu programu autopep8. Domyślnie używa katalogu głównego obszaru roboczego „${workspaceFolder}”. Możesz ustawić dla niego wartość „${fileDirname}”, aby użyć folderu nadrzędnego pliku sformatowanego jako katalog roboczy dla programu autopep8.","settings.importStrategy.description":"Definiuje, które dane binarne narzędzia do formatowania autopep8 mają być używane do formatowania plików w języku Python. Po ustawieniu wartości na „useBundled” rozszerzenie będzie używać danych binarnych narzędzia do formatowania autopep8 dostarczonych z rozszerzeniem. Po ustawieniu wartości na „fromEnvironment” rozszerzenie podejmie próbę użycia danych binarnych narzędzia do formatowania autopep8 i wszystkich zależności dostępnych w obecnie wybranym środowisku. **Uwaga**: Jeśli rozszerzenie nie może znaleźć prawidłowych danych binarnych narzędzia do formatowania autopep8 w wybranym środowisku, nastąpi powrót do użycia danych binarnych dostarczonych z rozszerzeniem. Ustawienie „autopep8.path” ma pierwszeństwo i przesłania zachowanie elementu „autopep8.importStrategy”.","settings.importStrategy.fromEnvironment.description":"Użyj danych binarnych narzędzia autopep8 z wybranego środowiska języka Python. Jeśli rozszerzenie nie może znaleźć prawidłowego pliku binarnego narzędzia autopep8, powróci do używania powiązanej wersji narzędzia autopep8.","settings.importStrategy.useBundled.description":"Zawsze używaj powiązanej wersji autopep8 do formatowania plików języka Python.","settings.interpreter.description":"Ścieżka do pliku wykonywalnego języka Python lub polecenia, które będzie używane do uruchamiania serwera autopep8 i dowolnego podprocesu. Akceptuje tablicę jednego lub wielu ciągów. Po ustawieniu wartości „[]” rozszerzenie użyje ścieżki do wybranego interpretera języka Python. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy.","settings.path.description":"Ścieżka lub polecenie, które ma być używane przez rozszerzenie do formatowania plików w języku Python za pomocą narzędzia autopep8. Akceptuje tablicę jednego lub wielu ciągów. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy. Jeśli zostanie ustawiona wartość „[\"autopep8\"]”, będzie używana wersja narzędzia autopep8 dostępna w zmiennej środowiskowej „PATH”. Uwaga: użycie tej opcji może spowolnić formatowanie. \n  Przykłady: \n  — „[\"~/global_env/autopep8\"]” \n  — „[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]”","settings.showNotifications.always.description":"Powiadomienia są wyświetlane dla wszystkiego, co serwer wybierze do wyświetlenia podczas formatowania plików w języku Python.","settings.showNotifications.description":"Określa, kiedy powiadomienia są wyświetlane przez to rozszerzenie.","settings.showNotifications.off.description":"Wszystkie powiadomienia są wyłączone, wszelkie błędy lub ostrzeżenia podczas formatowania plików w języku Python są nadal dostępne w dziennikach.","settings.showNotifications.onError.description":"Powiadomienia są wyświetlane tylko w przypadku błędu podczas formatowania plików w języku Python.","settings.showNotifications.onWarning.description":"Podczas formatowania plików w języku Python wyświetlane są powiadomienia o błędach i ostrzeżeniach."}
