{"command.restartServer":"Reiniciar Servidor","extension.description":"Suporte à formatação de arquivos do Python usando o formatador autopep8.","settings.args.description":"Argumentos passados para autopep8 para formatar arquivos do Python. Cada argumento deve ser fornecido como uma cadeia de caracteres separada na matriz. \n Exemplo: \n `\"autopep8.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Define o diretório de trabalho atual usado para formatar arquivos Python com autopep8. Por padrão, ele usa o diretório raiz do workspace “${workspaceFolder}”. Você pode configurá-lo como “${fileDirname}” para usar a pasta pai do arquivo que está sendo formatado como o diretório de trabalho do autopep8.","settings.importStrategy.description":"Define qual binário do formatador autopep8 será usado para formatar arquivos do Python. Quando definida como “useBundled”, a extensão usará o binário do formatador autopep8 que é fornecido com a extensão. Quando definida como “fromEnvironment”, a extensão tentará usar o binário do formatador autopep8 e todas as dependências que estão disponíveis no ambiente atualmente selecionado. **Observação**: se a extensão não conseguir localizar um binário do formatador autopep8 válido no ambiente selecionado, ela voltará a usar o binário fornecido com a extensão. A configuração “autopep8.path” tem precedência e substitui o comportamento de “autopep8.importStrategy”.","settings.importStrategy.fromEnvironment.description":"Use o binário autopep8 do ambiente do Python selecionado. Se a extensão não conseguir localizar um binário autopep8 válido, ela voltará a usar a versão empacotada do autopep8.","settings.importStrategy.useBundled.description":"Sempre use a versão empacotada do autopep8 para formatar arquivos do Python.","settings.interpreter.description":"Caminho para um executável do Python ou um comando que será usado para iniciar o servidor autopep8 e qualquer subprocesso. Aceita uma matriz de uma ou várias cadeia de caracteres. Quando definida como “[]”, a extensão usará o caminho para o interpretador do Python selecionado. Se estiver passando um comando, cada argumento deverá ser fornecido como uma cadeia de caracteres separada na matriz.","settings.path.description":"Caminho ou comando a ser usado pela extensão para formatar arquivos do Python com autopep8. Aceita uma matriz de uma ou várias cadeia de caracteres. Se estiver passando um comando, cada argumento deverá ser fornecido como uma cadeia de caracteres separada na matriz. Se definido como “[\"autopep8\"]”, ele usará a versão do autopep8 disponível na variável de ambiente “PATH”. Observação: usar essa opção pode retardar a formatação. \n  Exemplos: \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"As notificações são mostradas para qualquer coisa que o servidor opte por mostrar ao formatar arquivos Python.","settings.showNotifications.description":"Controla quando as notificações são mostradas por esta extensão.","settings.showNotifications.off.description":"Todas as notificações são desativadas e quaisquer erros ou avisos ao formatar arquivos Python ainda estão disponíveis nos logs.","settings.showNotifications.onError.description":"As notificações são mostradas somente no caso de um erro ao formatar arquivos Python.","settings.showNotifications.onWarning.description":"As notificações são mostradas para quaisquer erros e avisos ao formatar arquivos Python."}
