{"command.restartServer":"Redémarrer le serveur","extension.description":"Prise en charge du formatage des fichiers Python à l’aide du formateur autopep8.","settings.args.description":"Arguments passés à autopep8 pour mettre en forme des fichiers Python. Chaque argument doit être fourni en tant que chaîne distincte dans le tableau. \n Exemple : \n `\"autopep8.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Définit le répertoire de travail courant utilisé pour formater les fichiers Python avec autopep8. Le répertoire racine de l’espace de travail utilisé par défaut est `${workspaceFolder}`. Vous pouvez lui donner la valeur `${fileDirname}` pour utiliser le dossier parent du fichier en cours de formatage comme répertoire de travail pour autopep8.","settings.importStrategy.description":"Définit le binaire du formateur autopep8 à utiliser pour mettre en forme des fichiers Python. Lorsque la valeur est « useBundled », l’extension utilise le binaire de formateur autopep8 fourni avec l’extension. Lorsqu’elle est définie sur `fromEnvironment`, l’extension tente d’utiliser le binaire du formateur autopep8 et toutes les dépendances disponibles dans l’environnement actuellement sélectionné. **Remarque** : si l’extension ne trouve pas de binaire de formateur autopep8 valide dans l’environnement sélectionné, elle revient à l’utilisation du binaire fourni avec l’extension. Le paramètre « autopep8.path » est prioritaire et remplace le comportement de « autopep8.importStrategy ».","settings.importStrategy.fromEnvironment.description":"Utilisez le binaire autopep8 de l’environnement Python sélectionné. Si l’extension ne parvient pas à trouver un binaire autopep8 valide, elle utilise la version groupée de autopep8.","settings.importStrategy.useBundled.description":"Utilisez toujours la version groupée de autopep8 pour mettre en forme des fichiers Python.","settings.interpreter.description":"Chemin d’un exécutable Python ou d’une commande qui sera utilisée pour lancer le serveur autopep8 et tous les sous-processus. Accepte un tableau d’une ou plusieurs chaînes. Quand la valeur est '[]', l’extension utilise le chemin de l’interpréteur Python sélectionné. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau.","settings.path.description":"Chemin d’accès ou commande à utiliser par l’extension pour mettre en forme des fichiers Python avec autopep8. Accepte un tableau d’une ou plusieurs chaînes. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau. S’il a la valeur « [\"autopep8\"] », il utilise la version de autopep8 disponible dans la variable d’environnement « PATH ». Remarque : l’utilisation de cette option peut ralentir la mise en forme. \n  Exemples : \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"Les notifications s’affichent pour tout ce que le serveur choisit d’afficher lors de la mise en forme des fichiers Python.","settings.showNotifications.description":"Contrôle quand les notifications sont affichées par cette extension.","settings.showNotifications.off.description":"Toutes les notifications sont désactivées, les erreurs ou avertissements lors de la mise en forme des fichiers Python sont toujours disponibles dans les journaux.","settings.showNotifications.onError.description":"Les notifications s’affichent uniquement en cas d’erreur lors de la mise en forme des fichiers Python.","settings.showNotifications.onWarning.description":"Les notifications s’affichent pour les erreurs et avertissements lors de la mise en forme des fichiers Python."}
