{"command.restartServer":"Riavvia server","extension.description":"Supporto della formattazione per i file Python con il formattatore autopep8.","settings.args.description":"Argomenti passati a autopep8 per formattare i file Python. Ogni argomento deve essere fornito come stringa separata nella matrice. \n Esempio: \n `\"autopep8.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Imposta la directory di lavoro corrente usata per formattare i file Python con autopep8. Per impostazione predefinita, usa la directory radice dell’area di lavoro `${workspaceFolder}`. È possibile impostare su `${fileDirname}` per usare la cartella padre del file per cui viene effettuata la formattazione come directory di lavoro per autopep8.","settings.importStrategy.description":"Definisce il file binario del formattatore autopep8 da usare per formattare i file Python. Quando impostata su `useBundled`, l'estensione userà il file binario del formattatore autopep8 fornito con l'estensione. Se impostata su 'fromEnvironment', l'estensione tenterà di usare il file binario del formattatore autopep8 e tutte le dipendenze disponibili nell'ambiente attualmente selezionato. **Nota**: se l'estensione non riesce a trovare un file binario formattatore autopep8 valido nell'ambiente selezionato, verrà riportata all'uso del file binario fornito con l'estensione. L'impostazione `autopep8.path` ha la precedenza ed esegue l'override del comportamento di`autopep8.importStrategy`.","settings.importStrategy.fromEnvironment.description":"Usare il file binario autopep8 dall'ambiente Python selezionato. Se l'estensione non riesce a trovare un file binario di autopep8 valido, verrà eseguito il fallback all'uso della versione in bundle di autopep8.","settings.importStrategy.useBundled.description":"Usare sempre la versione in bundle di autopep8 per formattare i file Python.","settings.interpreter.description":"Percorso di un eseguibile Python o di un comando che verrà usato per avviare il server autopep8 e qualsiasi sottoprocesso. Accetta una matrice di una o più stringhe. Se impostata su `[]`, l'estensione userà il percorso dell'interprete Python selezionato. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice.","settings.path.description":"Percorso o comando che l'estensione deve usare per formattare i file Python con autopep8. Accetta una matrice di una o più stringhe. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice. Se impostato su `[\"autopep8\"]`, userà la versione di autopep8 disponibile nella variabile di ambiente`PATH`. Nota: l'uso di questa opzione può rallentare la formattazione. \n  Esempi: \n  - `[\"~/global_env/autopep8\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"autopep8\"]`","settings.showNotifications.always.description":"Le notifiche vengono visualizzate per tutti gli elementi che il server sceglie di visualizzare durante la formattazione dei file Python.","settings.showNotifications.description":"Controlla quando mostrare le notifiche da questa estensione.","settings.showNotifications.off.description":"Tutte le notifiche sono disattivate, ma eventuali errori o avvisi durante la formattazione dei file Python sono ancora disponibili nei log.","settings.showNotifications.onError.description":"Le notifiche vengono visualizzate solo in caso di errore durante la formattazione dei file Python.","settings.showNotifications.onWarning.description":"Le notifiche vengono visualizzate per eventuali errori e avvisi durante la formattazione dei file Python."}
